Repository: Alby7503/autoflashgui
Catalog: locale/*/LC_MESSAGES/autoflashgui.po
Languages: it

source: Load Default:
it: Profilo modem

source: Target IP:
it: IP dispositivo:

source: Username:
it: Nome utente:

source: Firmware File Name:
it: Nome file firmware:

source: Pick Firmware
it: Seleziona firmware

source: Flash firmware?
it: Flash del firmware?

source: I really truly know what I'm doing and I want to mess with the commands to tweak the firmware and I promise not to ask for help. :) I understand that if the unsplit (if selected) or split command is too long (suspected limit of about 245 on TG799) or if I use special characters it may fail. Avoid using & or ; (except splitting commands, unless escaped as a character code?).
it: So cosa sto facendo e voglio inviare i comandi per modificare il firmware e prometto di non chiedere aiuto. :) Capisco che il comando unsplit (se selezionato) o split è troppo lungo (il limite è di circa 245 nel TG799) o si usano caratteri speciali potrebbe fallire. Evita l'uso di & o; eccetto la divisione dei comandi (a meno che non sia sfuggito come carattere?).

source: Command:
it: Comando:

source: DDNS Service:
it: Servizio DDNS:

source: Split the given command on semicolons to try and use shorter commands with a 5 second delay between commands. If an individual command fails it should not affect subsequent commands.
it: Dividi il comando con punto e virgola per provare a usare i comandi più brevi con un ritardo di 5 secondi tra i comandi. Se un singolo comando fallisce, non dovrebbe influenzare i comandi successivi.

source: Run
it: Esegui

source: Status:
it: Stato:

source: Check the console window for detailed status or major failures (exceptions - try re-running a few times)
it: Controlla la finestra della console per i dettagli dello stato o gli errori (eccezioni - prova a ri-lanciare varie volte)

source: Selected new variant
it: Seleziona nuovo profilo

source: Please select firmware
it: Seleziona il firmware

source: Check the console window for detailed status or major failures
it: Controlla finestra della console per i dettagli e gli errori

source: Technicolor modem flash and unlock utility (v.
it: Modem technicolor - Utility flash e sblocco modem (v.

source: ) - By Mark Smith - License: GPLv3
it: ) - Autore: Mark Smith - Licenza: GPLv3

source: A value
it: UIn valore

source: Challenge received:
it: Challenge ricevuta:

source: M value
it: Valore M

source: Unable to authenticate (check password?), message:
it: Autebticazione fallita (verifica la password). Messaggio:

source: Unable to authenticate
it: Autebticazione fallita

source: Authentication failed, debug values are:
it: Autentificazioen fallita. I valori debug sono:

source: Exception:
it: Eccezione:

source: Unknown method
it: Metodo sconosciuto

source: please check input in GUI
it: controlla i valori inseriti nella GUI

source: Authenticating
it: Autentificazione

source: Sending flash command to modem
it: Invio comando flash al modem

source: Modem reports flashing commenced successfully
it: Il modem ha riportato il completamento dell'operazione di flash

source: Waiting for reboot... Sleeping for %s s
it: Attesa riavvio modem... Sleep per %s s

source: Connect attempt %i
it: Tentativo connessione %i

source: Failed to connect, attempt %i. Retrying
it: Conenssione fallita, tentativo %i. Riprovo

source: Modem up
it: Modem attivo

source: Splitting command up using semicolons
it: Dividi comandi con punto e virgola

source: Sleeping...
it: Sleep...

source: Please try a ssh connection now to
it: Prova ora una connessione SSH verso

source: with username root and password root (change password immediately with passwd!) Rebooting your modem now is recommended to stop any services that have been disabled.
it: con utente root e password root (cambia immediatamente la password con passwd!). Ora ti consiglio di riavviare il modem per interrompere tutti i servizi che sono stati disabilitati.

source: Both n_hex and g_hex are required when ng_type = NG_CUSTOM
it: Sono richiesti entrambi n_hex e g_hex qiando ng_type = NG_CUSTOM

source: 32 bytes required for bytes_a
it: sono richiesti 32byte per bytes_a
